---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SketchFailures.PathReinforcementClosedLoop
source: html/fc89aa1f-96f7-b941-8723-087d2f038d3b.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SketchFailures.PathReinforcementClosedLoop Property

Sketch contains a closed loop. Can't create Path Reinforcement.

## Syntax (C#)
```csharp
public static FailureDefinitionId PathReinforcementClosedLoop { get; }
```